dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
/**
  ******************************************************************************
  * @file    IO_Toggle/main.c 
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    23-March-2012
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include "stm32f0xx.h"
#include "pitches.h"

#include "stm32f0xx_gpio.h"
#include "stm32f0xx_rcc.h"
#include "stm32f0xx_usart.h"
#include "stm32f0xx_flash.h"
#include "stm32f0xx_spi.h"

SPI_InitTypeDef SPI_InitStruct;

TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
TIM_OCInitTypeDef  TIM_OCInitStructure;
TIM_ICInitTypeDef  TIM_ICInitStructure;

/** @addtogroup STM32F0_Discovery_Peripheral_Examples
  * @{
  */

/** @addtogroup IO_Toggle
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define BSRR_VAL        0x0300


/* Private macros ------------------------------------------------------------*/


#define STATUS_FREE    (0)
#define STATUS_WAITING (3)
#define STATUS_WORKING (1)
#define STATUS_COOLING (2)
#define START_COUNTER_TIME  1000
#define ENTER_SERVICE_DELAY 2000
#define SERVICE_NEXT_DELAY  200
#define EXIT_SERVICE_TIME   400
#define START_DELAY         200

// Buttons
#define BUTTON_START    (0x00)
#define BUTTON_FAN1     (0x03)
#define BUTTON_LICEVI   (0x0c)
#define BUTTON_CLIMA    (0x01)
#define BUTTON_PLUS     (0x07)
#define BUTTON_MINUS    (0x06)

// LEDs
#define LED_VOICE_GUIDE_0     (1 << 0x00)
#define LED_VOICE_GUIDE_L     (1 << 0x01)
#define LED_INFO_1            (1 << 0x02)
#define LED_INFO_L            (1 << 0x03)
#define LED_VOLUME_L          (1 << 0x04)
#define LED_CHANNEL_L         (1 << 0x05)
#define LED_LICEVI_L          (1 << 0x06)
#define LED_UNKNOWN_1         (1 << 0x07)
#define LED_UNKNOWN_L         (1 << 0x08)
#define LED_FAN1_L            (1 << 0x09)
#define LED_FAN2_L            (1 << 0x0a)
#define LED_SPRAY_BODY_L      (1 << 0x0b)
#define LED_SPRAY_HEAD_L      (1 << 0x0c)
#define LED_VITAL_L           (1 << 0x0d)
#define LED_RELAX_L           (1 << 0x0e)
#define LED_CLIMA_L           (1 << 0x0f)
#define LED_CLIMA_4           (1 << 0x10)
#define LED_CLIMA_3		      (1 << 0x11)
#define LED_CLIMA_2           (1 << 0x12)
#define LED_CLIMA_1           (1 << 0x13)
#define LED_FAN2_1            (1 << 0x14)
#define LED_FAN2_2            (1 << 0x15)
#define LED_FAN2_3            (1 << 0x16)
#define LED_FAN2_4            (1 << 0x17)
#define LED_FAN1_1            (1 << 0x18)
#define LED_FAN1_2            (1 << 0x19)
#define LED_FAN1_3            (1 << 0x1a)
#define LED_FAN1_4            (1 << 0x1b)
#define LED_SPRAY_BODY_1      (1 << 0x1c)
#define LED_SPRAY_HEAD_1      (1 << 0x1d)
#define LED_RELAX_1           (1 << 0x1e)
#define LED_VITAL_1           (1 << 0x1f)


/* Private variables ---------------------------------------------------------*/
GPIO_InitTypeDef        GPIO_InitStructure;
static long buzz_counter = 0;
static long pitches[255];
static long durations[255];
static int start_note = 0; // Or current note
static int end_note = 0;
static char digits[3];
static __IO uint32_t TimingDelay;
static int display_data=0;
USART_InitTypeDef USART_InitStructure;
USART_ClockInitTypeDef USART_ClockInitStruct;

typedef enum states {state_show_time,state_set_time,state_show_hours,state_enter_service,state_clear_hours,state_address,
	state_pre_time,state_cool_time,state_ext_mode}states;
static states state;
typedef enum modes {mode_null,mode_clear_hours,mode_set_address,mode_set_pre_time,mode_set_cool_time}modes;
static modes service_mode;
static unsigned char controller_address = 0x10;
static int curr_status;
static int prev_status;
static int curr_time;
static int flash_mode = 0;
static unsigned char  time_to_set = 0;
static unsigned int   work_hours[3] = {9,10,30}; //HH HL MM - Hours[2], Minutes[1]
static unsigned char  preset_pre_time = 7;
static unsigned char  preset_cool_time = 3;
static int start_counter = 0;
static int counter_hours = 0;
static int flash_counter_prev = 0;
static int last_button = 0;
static int prev_button = 0;
static int led_bits = 0x0;

// for Display:
static int led_counter = 0;
static int flash_counter = 0;
static int digit_num = 0;
typedef struct time_str{
	uint8_t used_flag :8;
	uint8_t hours_h   :8;
	uint8_t hours_l   :8;
	uint8_t minutes   :8;
}time_str;
typedef struct settings_str{
	uint8_t addresse  :8;
	uint8_t pre_time  :8;
	uint8_t cool_time :8;
	uint8_t unused    :8;
}settings_str;
typedef struct flash_struct{
	time_str time;
	settings_str settings;
}flash_struct;

/* Private function prototypes -----------------------------------------------*/
void push_note(int pitch, int duration);
void SystickDelay(__IO uint32_t nTime);
void ping_status(void);
int ToBCD(int value);
void send_time(void);
void send_start(void);
void write_eeprom(void);
void read_eeprom(void);
void TimingDelay_Decrement(void);


/* Global variables ----------------------------------------------------------*/

__IO uint32_t Gv_SystickCounter;
extern __IO uint32_t Gv_EOA; // Set by TS interrupt routine to indicate the End Of Acquisition

static const uint32_t eeprom_array[512] __attribute__ ((section (".eeprom1text")));


/* Private functions ---------------------------------------------------------*/
void Delay(__IO uint32_t nTime)
{
  TimingDelay = nTime;

  while(TimingDelay != 0);
}

#define S_a3 ((1<<16)>>16)
#define S_b3 ((1<<17)>>16)
#define S_c3 ((1<<18)>>16)
#define S_d3 ((1<<19)>>16)
#define S_e3 ((1<<21)>>16)
#define S_f3 ((1<<20)>>16)
#define S_g3 ((1<<22)>>16)

#define S_a4 ((1<<24)>>16)
#define S_b4 ((1<<25)>>16)
#define S_c4 ((1<<26)>>16)
#define S_d4 ((1<<27)>>16)
#define S_e4 ((1<<29)>>16)
#define S_f4 ((1<<28)>>16)
#define S_g4 ((1<<30)>>16)


static const int digits3[] = {
// 0:
	(S_a3 | S_b3 | S_c3 | S_d3 | S_e3 | S_f3),
// 1:
	(S_b3 | S_c3),
// 2:
	( S_a3 | S_b3 |  S_d3 | S_e3 | S_g3),
// 3:
	( S_a3 | S_b3 | S_c3 | S_d3 | S_g3),
// 4:
	( S_b3 | S_c3 |  S_f3 | S_g3),
// 5:
	( S_a3 | S_c3 | S_d3 |  S_f3 | S_g3),
// 6:
	( S_a3 |  S_c3 | S_d3 | S_e3 | S_f3 | S_g3),
// 7:
	( S_a3 | S_b3 | S_c3 ),
// 8:
	( S_a3 | S_b3 | S_c3 | S_d3 | S_e3 | S_f3 | S_g3),
// 9:
	( S_a3 | S_b3 | S_c3 | S_d3 | S_f3 | S_g3),
// 0x0A:
	( S_a3 | S_b3 | S_c3 |  S_e3 | S_f3 | S_g3),
// 0x0B:
	( S_c3 | S_d3 | S_e3 | S_f3 | S_g3),
// 0x0C:
	( S_a3 |  S_d3 | S_e3 | S_f3 ),
// 0x0D:
	( S_b3 | S_c3 | S_d3 | S_e3 |  S_g3),
// 0x0E:
	( S_a3 |  S_d3 | S_e3 | S_f3 | S_g3),
// 0x0F:
	(S_a3 |  S_e3 | S_f3 | S_g3),
// 0x10: "-"
	(S_g3)
};

static const int digits4[] = {
// 0:
	(S_a4 | S_b4 | S_c4 | S_d4 | S_e4 | S_f4),
// 1:
	(S_b4 | S_c4),
// 2:
	( S_a4 | S_b4 |  S_d4 | S_e4 | S_g4),
// 4:
	( S_a4 | S_b4 | S_c4 | S_d4 | S_g4),
// 4:
	( S_b4 | S_c4 |  S_f4 | S_g4),
// 5:
	( S_a4 | S_c4 | S_d4 |  S_f4 | S_g4),
// 6:
	( S_a4 |  S_c4 | S_d4 | S_e4 | S_f4 | S_g4),
// 7:
	( S_a4 | S_b4 | S_c4 ),
// 8:
	( S_a4 | S_b4 | S_c4 | S_d4 | S_e4 | S_f4 | S_g4),
// 9:
	( S_a4 | S_b4 | S_c4 | S_d4 | S_f4 | S_g4),
// 0x0A:
	( S_a4 | S_b4 | S_c4 |  S_e4 | S_f4 | S_g4),
// 0x0B:
	( S_c4 | S_d4 | S_e4 | S_f4 | S_g4),
// 0x0C:
	( S_a4 |  S_d4 | S_e4 | S_f4 ),
// 0x0D:
	( S_b4 | S_c4 | S_d4 | S_e4 |  S_g4),
// 0x0E:
	( S_a4 |  S_d4 | S_e4 | S_f4 | S_g4),
// 0x0F:
	(S_a4 |  S_e4 | S_f4 | S_g4),
// 0x10: "-"
	(S_g4)
};


void show_digit(int digit){

