dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
	int i,j,digit_data;
//	if(last_button) digit = last_button;
	digit = digit & 0xFF;


	// LEDs 1
	SPI_I2S_SendData16(SPI1, (~led_bits)>>16);
	while (SPI_GetTransmissionFIFOStatus(SPI1) != SPI_TransmissionFIFOStatus_Empty);

	// LEDs 2
	SPI_I2S_SendData16(SPI1, (~led_bits )& 0xFFFF);
	while (SPI_GetTransmissionFIFOStatus(SPI1) != SPI_TransmissionFIFOStatus_Empty);

	// Rightmost 2 digits
	digit_data = digits3[digit & 0x0f] | digits4[0x10];
	digit_data = ~digit_data;
	SPI_I2S_SendData16(SPI1, digit_data);
	while (SPI_GetTransmissionFIFOStatus(SPI1) != SPI_TransmissionFIFOStatus_Empty);
	// Flush Receive FIFO just in case
	while(SPI_GetReceptionFIFOStatus(SPI1)) last_button = SPI_I2S_ReceiveData16(SPI1);
	while(SPI_GetReceptionFIFOStatus(SPI1)) last_button = SPI_I2S_ReceiveData16(SPI1);
	while(SPI_GetReceptionFIFOStatus(SPI1)) last_button = SPI_I2S_ReceiveData16(SPI1);

	// Leftmost 2 digits
	digit_data = digits3[0x10] | digits4[digit>>4];
	digit_data = ~digit_data;
	GPIOB->BSRR = GPIO_BSRR_BS_2; // enable shift FOR BUTTONS
	for (i = 0; i< 2000; i++);
	SPI_I2S_SendData16(SPI1, digit_data);
	while (SPI_GetTransmissionFIFOStatus(SPI1) != SPI_TransmissionFIFOStatus_Empty);
	while(SPI_GetReceptionFIFOStatus(SPI1)) last_button = SPI_I2S_ReceiveData16(SPI1);
	GPIOB->BRR = GPIO_BSRR_BS_2; // disable shift FOR BUTTONS
	for (i = 0; i<16; i++){
		j = (last_button>>i) & 1;
		if(!j){
			last_button = i;
			break;
		}
	}
 }

int get_controller_status(int n){
	int counter = 10000;
	static int sts, data;
	// clear in fifo
	// send conmmand
	while(USART_GetFlagStatus(USART1,USART_FLAG_RXNE))	data =  USART_ReceiveData(USART1); // Flush input
    while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET); // wAIT UNTIL TX BUFFER IS EMPTY
	USART_SendData(USART1,0x80 | ((n & 0x0f)<<3) | 0);
//    delta = (delta + 1)& 0xff;
//	USART_SendData(USART1,delta);

//	USART_SendData(USART1,0x0f);
	while(counter){
		//read Rx buffer
		sts = USART_GetFlagStatus(USART1,USART_FLAG_RXNE);
		if(sts) {
			data =  USART_ReceiveData(USART1);
//			while(1);
			return (data);
			break;
		}
		counter--;
	}
	return -1;
}
// Function to get controller's address
void get_address(void){
	int i, result;
	for (i = 0; i<16; i++){
		result = get_controller_status(i);
		if (result!=-1) break;
	}
	controller_address = i;
}


/**
  * @brief  Main program.
  * @param  None
  * @retval None
  */
int main(void)
{

  /*!< At this stage the microcontroller clock setting is already configured, 
       this is done through SystemInit() function which is called from startup
       file (startup_stm32f0xx.s) before to branch to application main.
       To reconfigure the default setting of SystemInit() function, refer to
       system_stm32f0xx.c file
     */

	 /* GPIO Periph clock enable */
	  RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA | RCC_AHBPeriph_GPIOB | RCC_AHBPeriph_GPIOC | RCC_AHBPeriph_GPIOF, ENABLE);
 /* UART1 Clock enable; SPI1 Clock enable*/
	  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_SPI1,ENABLE);


/*
 * Outputs:
 * PA2 - Digit 0, COL1 (klaviatura)
 * PA1 - Digit 1, COL2 (klaviatura)
 * PA0 - Digit 2, COL3 (klaviatura)
 *
 * PA13 - BAR1 (Group)
 * PA14 - BAR2 (Group)
 *
 *
 * PB2,PB1 - a , BAR1
 * PC6,PC7 - b , BAR8
 * PC4,PB15 - c , BAR3
 * PF5,PB14 - d , BAR5
 * PF4, PA3 - e , BAR6
 * PB13,PB12 - f , BAR7
 * PB0,PC5 - g , BAR2
 * PC15,PF0 - DP , BAR4
 *
 *
 *    A
 *  F   B
 *    G
 *  E   C
 *    D
 *        DP
 *
 * PA12, PA11 - BAR9, AquaFresh(1,2),
 * PA8, PC10 - BAR10, AquaFresh(1,2)
 *
 * PC8 - Lamp 1
 * PC9 - Lamp 2
 * PB5 - Auqa fresh
 * PC14 - Ventilator 2
 * PB4 - Ventilator 1
 *
 * PC13 - STBY of amplifier
 *
 * SPECIAL FUNCTIONS:
 *
 * PB6 - I2C2_SDA_0 - Left input
 * PB7 - I2C2_SCL_0
 * PB11 - I2C2_SDA_1 - Right input
 * PB10 - I2C2_SCL_1
 * PF7 - I2C2_SDA_2 - Left internal
 * PF6 - I2C2_SCL_2
 * PB8 -  I2C_SCL_3 - Right internal
 * PB9 -  I2C_SDA_3
 *
 *
 * PA15 - SPI1_NSS
 * PA7 - MISO
 * PA6 - MOSI
 * PA5 - SPI_CLK
 *
 * PA4 - DAC_OUT
 *
 *
 * INPUTS:
 * PC11 - ROW1 - klaviatura
 * PC12 - ROW2 - klaviatura
 * PD2  - ROW3 - klaviatura
 *
 *
 */
	  /*
	   *
	   * */

	  /* Configure PA in output push-pull mode (for segments)*/
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_8 |GPIO_Pin_10 | GPIO_Pin_11| GPIO_Pin_12 ; // LATER!| GPIO_Pin_13 | GPIO_Pin_14;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOA, &GPIO_InitStructure);

	  /* Configure PB in output push-pull mode (for segments  )*/
//	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2  | GPIO_Pin_4  | GPIO_Pin_5 | GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2  | GPIO_Pin_9 |  GPIO_Pin_11 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOB, &GPIO_InitStructure);

	  /* Configure PC in output push-pull mode (for segments )*/
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_5 | GPIO_Pin_6|GPIO_Pin_7 | GPIO_Pin_10 | GPIO_Pin_13 | GPIO_Pin_14;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOC, &GPIO_InitStructure);

	  /* Configure PF4 in output push-pull mode (for segments )*/
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_4|GPIO_Pin_5;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOF, &GPIO_InitStructure);


//	  //Configure SPI pins:   ----------------------------
	  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7 ;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOA, &GPIO_InitStructure);

	  //Configure SPI pins:   ----------------------------
//	  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5 ;
//	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
//	  GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
//	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
//	  GPIO_Init(GPIOB, &GPIO_InitStructure);

	  //Configure Timer 2 pins:   ----------------------------
	  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_1;
	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	  GPIO_Init(GPIOA, &GPIO_InitStructure);

	  //Configure Timer 2 pins:   ----------------------------
	  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_3;
	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	  GPIO_Init(GPIOA, &GPIO_InitStructure);

	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource1, GPIO_AF_2); // TIM2_CH2
	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_2); // TIM2_CH4



