dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
//	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource15, GPIO_AF_0); // SPI1_NSS
	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_0); // MISO
	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource6, GPIO_AF_0); // MOSI
	  GPIO_PinAFConfig(GPIOA, GPIO_PinSource5, GPIO_AF_0); // SPI_CLK

//	  GPIO_PinAFConfig(GPIOB, GPIO_PinSource4, GPIO_AF_0); // MISO
//	  GPIO_PinAFConfig(GPIOB, GPIO_PinSource5, GPIO_AF_0); // MOSI
//	  GPIO_PinAFConfig(GPIOB, GPIO_PinSource3, GPIO_AF_0); // SPI_CLK

	  //Configure USART2 pins:  Rx and Tx ----------------------------
//	  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_6 | GPIO_Pin_7;
//	  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//	  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
//	  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
//	  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
//	  GPIO_Init(GPIOB, &GPIO_InitStructure);

//	  GPIO_PinAFConfig(GPIOB, GPIO_PinSource6, GPIO_AF_0); // USART1_TX
//	  GPIO_PinAFConfig(GPIOB, GPIO_PinSource7, GPIO_AF_0); // USART1_RX
//
//	  USART_InitStructure.USART_BaudRate = 1200;
//	  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
//	  USART_InitStructure.USART_StopBits = USART_StopBits_1;
//	  USART_InitStructure.USART_Parity = USART_Parity_No;
//	  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
//	  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
//	  USART_Init(USART1, &USART_InitStructure);
//	  USART_InvPinCmd(USART1,USART_InvPin_Tx,ENABLE);
//
//	  USART_Cmd(USART1,ENABLE);
	  {
		  uint16_t tmpreg = SPI1->CR1;

//		  SPI_StructInit(&SPI_InitStruct);
		  memset(&SPI_InitStruct, 0, sizeof(SPI_InitStruct));
		  SPI_InitStruct.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
		  SPI_InitStruct.SPI_Mode = SPI_Mode_Master;
		  SPI_InitStruct.SPI_DataSize = SPI_DataSize_16b;
		  SPI_InitStruct.SPI_CPOL = SPI_CPOL_High;
		  SPI_InitStruct.SPI_CPHA = SPI_CPHA_1Edge;
		  SPI_InitStruct.SPI_FirstBit = SPI_FirstBit_MSB;
		  SPI_InitStruct.SPI_NSS = SPI_NSS_Soft;
		  SPI_InitStruct.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256;

		  SPI_Init(SPI1,&SPI_InitStruct);

		  SPI_Cmd(SPI1, ENABLE);
	  }


	  // Real time timer
	  RCC->APB1ENR |= RCC_APB1ENR_TIM6EN; // Enable TIM6 clock
	  TIM6->PSC = 41; // Set prescaler to 41999
	  TIM6->ARR = 599; // Set auto-reload to 5999
//	  TIM6->CR1 |= TIM_CR1_OPM; // One pulse mode
	  TIM6->CR1 |= TIM_CR1_ARPE; // Auto reload
	  TIM6->EGR |= TIM_EGR_UG; // Force update
	  TIM6->SR &= ~TIM_SR_UIF; // Clear the update flag
	  TIM6->DIER |= TIM_DIER_UIE; // Enable interrupt on update event
	  NVIC_EnableIRQ(TIM6_DAC_IRQn); // Enable TIM6 IRQ
	  TIM6->CR1 |= TIM_CR1_CEN; // Enable TIM6 counter

	  // Zero cross detection timer

//	  RCC->APB1ENR |= RCC_APB1ENR_TIM2EN; // Enable TIM1 clock
//	  TIM2->PSC = 32768; // Set prescaler to 32768
//	  TIM2->ARR = 100; // Set auto-reload to 100 - the pulse width
//	  TIM2->CR1 |= TIM_CR1_OPM | TIM_CR1_ARPE; // One pulse mode /  Auto reload
//	  TIM2->EGR |= TIM_EGR_UG; // Force update
//	  TIM2->SR &= ~TIM_SR_UIF; // Clear the update flag
//	  TIM2->DIER |= TIM_DIER_UIE; // Enable interrupt on update event
//	  NVIC_EnableIRQ(TIM2_IRQn); // Enable TIM2 IRQ



	  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

	  TIM_TimeBaseStructure.TIM_Prescaler = 4000 ;
	  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	  TIM_TimeBaseStructure.TIM_Period = 50 ;
	  TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	  TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

	  /* TIM2 PWM2 Mode configuration: Channel4 */
	  //for one pulse mode set PWM2, output enable, pulse (1/(t_wanted=TIM_period-TIM_Pulse)), set polarity high
	  TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
	  TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	  TIM_OCInitStructure.TIM_Pulse = 45;
	  TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;

	  TIM_OC4Init(TIM2, &TIM_OCInitStructure);

	  /* TIM2 configuration in Input Capture Mode */

	  TIM_ICStructInit(&TIM_ICInitStructure);
	  TIM_ICInitStructure.TIM_Channel = TIM_Channel_2;
	  TIM_ICInitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;
	  TIM_ICInitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	  TIM_ICInitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	  TIM_ICInitStructure.TIM_ICFilter = 0;


	  TIM_ICInit(TIM2, &TIM_ICInitStructure);

	  /* One Pulse Mode selection */
	  TIM_SelectOnePulseMode(TIM2, TIM_OPMode_Single);

	  /* Input Trigger selection */
	  TIM_SelectInputTrigger(TIM2, TIM_TS_TI2FP2);

	  /* Slave Mode selection: Trigger Mode */
	  TIM_SelectSlaveMode(TIM2, TIM_SlaveMode_Trigger);

	  TIM_OC4PreloadConfig(TIM2, TIM_OCPreload_Enable);

	  /* OPM Bit -> Only one pulse */
	  TIM_SelectOnePulseMode (TIM2, TIM_OPMode_Single);
	  TIM2->DIER |= TIM_DIER_UIE; // Enable interrupt on update event
	  NVIC_EnableIRQ(TIM2_IRQn); // Enable TIM2 IRQ
	  /* TIM2 enable counter */
	  TIM_Cmd(TIM2, ENABLE);
	  SysTick_Config(SystemCoreClock / (1000));

	  while(1){
		  int j,k;

		  long long int i;
		  for (i = 0; i<32; i++){
		  		k = (led_bits>>i) & 1;
		  		if(k){
		  			k = i;
		  			break;
		  		} else k = 0xFF;
		  	}
		  show_digit(k);
//		  SPI_I2S_SendData16(SPI1, 0x0001<<k);
//		  SPI_I2S_SendData16(SPI1, 0x0001<<(k - 15));
		  for (i = 0; i< 56553; i++){
			  i = i +1;
		  }
		  GPIOB->BSRR = GPIO_BSRR_BS_11; // Trigger latch

		  for (i = 0; i< 56553; i++){
			  i = i + 1;
		  }
		  GPIOB->BRR = GPIO_BSRR_BS_11;
//		  if(k&1){
//			  GPIOA->BSRR = GPIO_BSRR_BS_6; // Trigger data
//		  }else GPIOA->BRR = GPIO_BSRR_BS_6;
		  k++;
		  if(k>40) k = 0;
		  if (last_button < 0x0f){
			  if(last_button != prev_button){
				  switch(last_button){
				  case BUTTON_START:
					  break;
				  case BUTTON_FAN1:
					  break;
				  case BUTTON_LICEVI:
					  break;
				  case BUTTON_CLIMA:
					  break;
				  case BUTTON_PLUS:
				  {
					if(  led_bits){
						led_bits = led_bits <<1;
					} else {
						led_bits = 0x01;
					}
				  }
					  break;
				  case BUTTON_MINUS:
					  if(  led_bits){
						  led_bits = led_bits >>1;
					  } else {
						  led_bits = 0x01 << 31;
					  }
					  break;
				  }
				 prev_button =  last_button;
			  }
//			  GPIOB->BSRR = GPIO_BSRR_BS_9 | GPIO_BSRR_BS_14 | GPIO_BSRR_BS_13;
//			  GPIOA->BSRR = GPIO_BSRR_BS_11 | GPIO_BSRR_BS_10;
		  } else {
			  prev_button = last_button;
//			  GPIOB->BRR = GPIO_BSRR_BS_9 | GPIO_BSRR_BS_14 | GPIO_BSRR_BS_13;
//			  GPIOA->BRR = GPIO_BSRR_BS_11 | GPIO_BSRR_BS_10;
		  }
	  }



	  GPIOC->BSRR = GPIO_BSRR_BS_13; // Trigger latch

