dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
		}
	}
	else
	{
		if(start_counter){
			if(state == state_show_hours){
				start_counter--;
				if(!start_counter){
					state = state_show_time;
				}
			}
			else if(state >= state_enter_service){
				if(state == state_enter_service){
					state = service_mode + state_enter_service;
				}
				start_counter--;
				if(!start_counter){
					state = state_show_time;
				}
			}
			else {
				start_counter = 0;

			}
		}
		if(prev_status != curr_status){
			if (prev_status == STATUS_WAITING && curr_status == STATUS_WORKING){
				work_hours[2]+=time_to_set;
				if(work_hours[2]>59){
					work_hours[2]=work_hours[2]-60;
					work_hours[1]++;
					if(work_hours[1]>99){
						work_hours[1] = 0;
						work_hours[0]++;
					}
				}
				write_eeprom();
				time_to_set = 0;
			}
			prev_status = curr_status;

		}
		//    LED1_OFF;
	}

	// TKEY 1
	if (TEST_TKEY(2))
	{
//		LED2_ON;
	}
	else
	{
//		LED2_OFF;
	}



#if USE_LCD > 0
	LcdDisplayStatus();
#endif
}



/**
  * @brief  Executed when a sensor is in Error state
  * @param  None
  * @retval None
  */
void MyTKeys_ErrorStateProcess(void)
{
  // Add here your own processing when a sensor is in Error state
//  TSL_tkey_SetStateOff();
//  LED1_ON;
//  LED2_OFF;

  for (;;)
  {
	display_data = 0xEEE;
//    LED1_TOGGLE;
    SystickDelay(100);
    display_data = 0x000;
    SystickDelay(100);
  }
}


/**
  * @brief  Executed when a sensor is in Off state
  * @param  None
  * @retval None
  */
void MyTKeys_OffStateProcess(void)
{
  // Add here your own processing when a sensor is in Off state
}


//-------------------
// CallBack functions
//-------------------

/**
  * @brief  Executed at each timer interruption (option must be enabled)
  * @param  None
  * @retval None
  */
void TSL_CallBack_TimerTick(void)
{
}


#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  LED1_OFF;
  LED2_ON;
  for (;;)
  {
    LED1_TOGGLE;
    LED2_TOGGLE;
    SystickDelay(100);
  }
}
#endif


/**
  * @brief  Add a delay using the Systick
  * @param  nTime Delay in milliseconds.
  * @retval None
  */
void SystickDelay(__IO uint32_t nTime)
{

  Gv_SystickCounter = nTime;
  while (Gv_SystickCounter != 0)
  {
    // The Gv_SystickCounter variable is decremented every ms by the Systick interrupt routine
  }

}

void TimingDelay_Decrement(void)
{
	if (Gv_SystickCounter != 0x00)
	{
		Gv_SystickCounter--;
	}
//	TSL_tim_ProcessIT();
/*
	if(++led_counter>6){
		led_counter = 0;
		digit_num++;
		flash_counter++;
		if(digit_num>2) digit_num = 0;
		GPIOA->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_1 | GPIO_BSRR_BR_2; // Turn off the lights while changing them
		show_digit(((display_data & 0xFFF)& (0x0F<<(digit_num*4)))>>(digit_num*4));
		if(flash_mode < 3 ||(flash_counter & 0x40)){
			switch (digit_num){
			case 2:
				GPIOA->BSRR = GPIO_BSRR_BS_2 ;
				GPIOA->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_1;
				break;

			case 1:
				GPIOA->BSRR = GPIO_BSRR_BS_1 ;
				GPIOA->BSRR = GPIO_BSRR_BR_0 | GPIO_BSRR_BR_2;
				break;
			case 0:
			default:
				GPIOA->BSRR = GPIO_BSRR_BS_0 ;
				GPIOA->BSRR = GPIO_BSRR_BR_1 | GPIO_BSRR_BR_2;
				break;
			}
		}
		if (((flash_mode == 1)&& digit_num == 0 && (flash_counter & 0x40)) || ((flash_mode == 2) && (digit_num == 2))){
			GPIOA->BSRR = GPIO_BSRR_BS_6 | GPIO_BSRR_BS_5;
		}
	}
	*/
}

void Process_TS_Int(void){
//	Gv_EOA = 1 +  (0!=(TSC->ISR & 0x02)); // Indicate Error also by MCEIF (MaxCount Error)

}

void key_pressed_event(void){

}

void KeyPressed_0(void){//START Key(Left)

//	push_note(E2,2);
//	push_note(G2,2);
//	push_note(C3,2);
	if( curr_status == STATUS_WAITING ){
		push_note(C3,6);
		push_note(E3,4);
		//send_start();
	}
	if((curr_status == STATUS_FREE)) {
		if(time_to_set){
// Send of time moved elsewhere
		} else {
			if (state > state_enter_service){
				// Write EEPROM
				if(state == state_clear_hours){
					work_hours[0] = 0;
					work_hours[1] = 0;
					work_hours[2] = 0;
				}
				write_eeprom();
				read_eeprom();
				start_counter = 0;
				service_mode = mode_null;
			} else {
				start_counter = START_COUNTER_TIME;
			}
			state = state_show_hours;
		}
	}
}
void KeyPressed_1(void){// START Key (Right)
	KeyPressed_0();
}
void KeyPressed_2(void){ // +
	if(state == state_show_hours) {
		state = state_set_time;
		start_counter = 0;
	}
	if(state == state_set_time){
		if(time_to_set < 25){
			time_to_set ++;
//			if((time_to_set & 0x0F)>9) time_to_set +=6;
		}
	}
	else if(state > state_enter_service){
		start_counter = EXIT_SERVICE_TIME;
		switch (service_mode){
		case mode_set_address:
			break;
		case mode_set_pre_time:
			if(preset_pre_time<9) preset_pre_time++;
			break;
		case mode_set_cool_time:
			if(preset_cool_time<9) preset_cool_time++;
			break;
		default:
			break;
		}
	}
	push_note(A3,8);
}
void KeyPressed_3(void){ // -
	if(state == state_show_hours) {
		state = state_set_time;
		start_counter = 0;
	}
	if(state == state_set_time){
		if(time_to_set) {
			time_to_set--;
		}
	}else if(state > state_enter_service){
		start_counter = EXIT_SERVICE_TIME;
		switch (service_mode){
		case mode_set_address:
			break;
		case mode_set_pre_time:
			if(preset_pre_time) preset_pre_time--;
			break;
		case mode_set_cool_time:
			if(preset_cool_time) preset_cool_time--;
			break;
		default:
			break;
		}
	}

//	if((time_to_set & 0x0F)>9) time_to_set -=6;
	push_note(A3,8);

}

void ping_status(void){
	static int ping_counter=0;
	// Ping solarium for status
	if(++ping_counter>600){
		ping_counter = 0;
		if(controller_address >15){
			display_data = 0xEEE;
		} else {
			int sts = get_controller_status(controller_address);
			if(sts != -1){
				curr_status = (sts & 0xC0)>>6;
				curr_time = sts & 0x3F;
			} else {
				curr_status = -1;
				curr_time = 0;
			}
		}
		curr_time = FromBCD(curr_time);
	}
}

